# Edit By @pikyus1
# RAM-UBOT
# beberapa gambar dari @greyyvbss
# Terima kasih untuk semua creator yang membuat animasi gambar✨
# Maaf bagi creator yang tidak sempat dicantumkan atas kelalaian saya 🙏🏻 
# collect image animation by @punya_alby
# Modifikasi edit by @punya_alby
# Jangan Dihapus Credits nya bodoh
# DAH CAPE NIH NGUMPULIN ANIMASI GAMBAR SANA SINI
# ░█████╗░██╗░░░░░██████╗░██╗░░░██╗
# ██╔══██╗██║░░░░░██╔══██╗╚██╗░██╔╝
# ███████║██║░░░░░██████╦╝░╚████╔╝░
# ██╔══██║██║░░░░░██╔══██╗░░╚██╔╝░░
# ██║░░██║███████╗██████╦╝░░░██║░░░
# ╚═╝░░╚═╝╚══════╝╚═════╝░░░░╚═╝░░░
# PERSETAN DENGAN ORANG YANG HAPUS CREDIT
# ⚠️ Do not remove credits ⚠️

from userbot.events import register


@register(outgoing=True, pattern='^.thanks(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("●▬▬▬▬ஜ۩۞۩ஜ▬▬▬▬●\n"
                     "▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄\n"
                     "╔══╦╗────╔╗─╔╗╔╗\n"
                     "╚╗╔╣╚╦═╦═╣╚╗║╚╝╠═╦╦╗\n"
                     "─║║║║║╬║║║╩║╚╗╔╣║║║║\n"
                     "─╚╝╚╩╩╩╩╩╩╩╝─╚╝╚═╩═╝\n"
                     "▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄\n"
                     "●▬▬▬▬ஜ۩۞۩ஜ▬▬▬▬●")


@register(outgoing=True, pattern='^.malam(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("╔═╦═╦╗╔═╦══╦═╦══╗\n"
                     "║═╣═╣║║╬║║║║╬╠╗╔╝\n"
                     "╠═║═╣╚╣║║║║║║║║║\n"
                     "╚═╩═╩═╩╩╩╩╩╩╩╝╚╝\n\n"
                     "╔══╦═╦╗╔═╦══╗\n"
                     "║║║║╬║║║╬║║║║\n"
                     "║║║║║║╚╣║║║║║\n"
                     "╚╩╩╩╩╩═╩╩╩╩╩╝")


@register(outgoing=True, pattern='^.rumah(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("**GAMBAR RUMAH**\n"
                     "╱◥◣\n"
                     "│∩ │◥███◣ ╱◥███◣\n"
                     "╱◥◣ ◥████◣▓∩▓│∩ ║\n"
                     "│╱◥█◣║∩∩∩ ║◥█▓ ▓█◣\n"
                     "││∩│ ▓ ║∩田│║▓ ▓ ▓∩ ║\n"
                     "๑۩๑๑۩๑๑ ۩๑๑۩๑▓๑۩๑๑۩๑")


@register(outgoing=True, pattern='^.join(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("_/﹋\\_\n"
                     "(҂`_´)\n"
                     "<,︻╦╤─ ҉\n"
                     r"_/﹋\_"
                     "\n**ᴊᴏɪɴ ʟɪɴᴋ ʙɪᴏ😡**")


@register(outgoing=True, pattern='^.tembak(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("_/﹋\\_\n"
                     "(҂`_´)\n"
                     "<,︻╦╤─ ҉\n"
                     r"_/﹋\_"
                     "\n**Pacaran sama aku atau kamu mati?!**")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.begal(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("_/﹋\\_\n"
                     "(҂`_´)\n"
                     "<,︻╦╤─ ҉\n"
                     r"_/﹋\_"
                     "\n**Pilih Harta apa Nyawa?!**")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.tmo(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("_/﹋\\_\n"
                     "(҂`_´)\n"
                     "<,︻╦╤─ ҉\n"
                     r"_/﹋\_"
                     "\n**ᴊᴏɪɴ ᴛᴍᴏ ʟɪɴᴋ ᴅɪ ʙɪᴏ**")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.ch(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("_/﹋\\_\n"
                     "(҂`_´)\n"
                     "<,︻╦╤─ ҉\n"
                     r"_/﹋\_"
                     "\n**ᴊᴏɪɴ ᴄʜᴀɴɴᴇʟ ʟɪɴᴋ ᴅɪ ʙɪᴏ**")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.lari(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "──▄█▀█▄─────────██\n"
        "▄████████▄───▄▀█▄▄▄▄\n"
        "██▀▼▼▼▼▼─▄▀──█▄▄\n"
        "█████▄▲▲▲─▄▄▄▀───▀▄\n"
        "██████▀▀▀▀─▀────────▀▀\n"
        " **LARI ADA DINO**\n")
    
@register(outgoing=True, pattern=r"^\.lari2$")
async def leave(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("────██──────▀▀▀██\n"
                     "──▄▀█▄▄▄─────▄▀█▄▄▄\n"
                     "▄▀──█▄▄──────█─█▄▄\n"
                     "─▄▄▄▀──▀▄───▄▄▄▀──▀▄\n"
                     "─▀───────▀▀─▀───────▀▀\n`Kabur Ah, Banyak Anak Haram disini, Awowkowkwk..`")


@register(outgoing=True, pattern=r"^\.lari3$")
async def leave(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("────██──────▀▀▀██\n"
                     "──▄▀█▄▄▄─────▄▀█▄▄▄\n"
                     "▄▀──█▄▄──────█─█▄▄\n"
                     "─▄▄▄▀──▀▄───▄▄▄▀──▀▄\n"
                     "─▀───────▀▀─▀───────▀▀\n`Kabur Ah, Banyak madesu disini, Awowkowkwk..`")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern=r"^\.lari4$")
async def leave(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("────██──────▀▀▀██\n"
                     "──▄▀█▄▄▄─────▄▀█▄▄▄\n"
                     "▄▀──█▄▄──────█─█▄▄\n"
                     "─▄▄▄▀──▀▄───▄▄▄▀──▀▄\n"
                     "─▀───────▀▀─▀───────▀▀\n`Gamau tanggung jawab, Kaaaburrr, Awowkowkwk..`")


# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern=r"^\.lari5$")
async def leave(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("────██──────▀▀▀██\n"
                     "──▄▀█▄▄▄─────▄▀█▄▄▄\n"
                     "▄▀──█▄▄──────█─█▄▄\n"
                     "─▄▄▄▀──▀▄───▄▄▄▀──▀▄\n"
                     "─▀───────▀▀─▀───────▀▀\n`Selagi bisa lari kenapa harus jalan, Awowkowkwk..`")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.lari6(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("────██──────▀▀▀██\n"
                     "──▄▀█▄▄▄─────▄▀█▄▄▄\n"
                     "▄▀──█▄▄──────█─█▄▄\n"
                     "─▄▄▄▀──▀▄───▄▄▄▀──▀▄\n"
                     "─▀───────▀▀─▀───────▀▀\n`Awkwokwokwok..`")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.truk(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "──────▄▌▐▀▀▀▀▀▀▀▀▀▀▀▀▌\n"
        "───▄▄██▌█░░░░░░░░░░░░▐\n"
        "▄▄▄▌▐██▌█░░░░░░░░░░░░▐\n"
        "███████▌█▄▄▄▄▄▄▄▄▄▄▄▄▌\n"
        "▀❍▀▀▀▀▀▀▀❍❍▀▀▀▀▀▀❍❍▀\n")


@register(outgoing=True, pattern='^.kingkong(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "▒▒▒▒▒▄██████████▄▒▒▒▒▒\n"
        "▒▒▒▄██████████████▄▒▒▒\n"
        "▒▒████████████████▄▒▒▒\n"               
        "▒▐███▀▀▀▀▀██▀▀▀▀▀███▌▒\n"
        "▒███▒▒▌■▐▒▒▒▒▌■▐▒▒███▒\n"
        "▒▐██▄▒▀▀▀▒▒▒▒▀▀▀▒▄██▌▒\n"
        "▒▒▀████▒▄▄▒▒▄▄▒████▀▒▒\n"
        "▒▒▐███▒▒▒▀▒▒▀▒▒▒███▌▒▒\n"
        "▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒\n"
        "▒▒▒██▒▒▀▀▀▀▀▀▀▀▒▒██▒▒▒\n"
        "▒▒▒▐██▄▒▒▒▒▒▒▒▒▄██▌▒▒▒\n"
        "▒▒▒▒▀████████████▀▒▒▒▒\n")
    
    
@register(outgoing=True, pattern='^.hmm(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        " ╭━┳━╭━╭━╮╮\n"
        " ┃┈┈┈┣▅╋▅┫┃\n"
        " ┃┈┃┈╰━╰━━━━━━╮\n"
        " ╰┳╯┈┈┈┈┈┈┈┈┈◢▉◣\n"
        "   ╲┃┈┈┈┈┈┈┈┈┈┈▉▉▉\n"
        "   ╲┃┈┈┈┈┈┈┈┈┈┈◥▉◤\n"
        "   ╲┃┈┈┈┈╭━┳━━━━╯\n"
        "   ╲┣━━━━━━┫\n"
        "      **MENCURIGAKAN**\n")
    

@register(outgoing=True, pattern='^.wlee(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "┈╭━━━━━━━━━━━╮┈\n" 
        "╭╯┈╭━━╮┈╭━━╮┈╰╮\n" 
        "┃┈┃┃╭╮┃┈┃╭╮┃┃┈┃\n" 
        "┃┈┃┻┻┻┛┈┗┻┻┻┃┈┃\n" 
        " ┃┈┃╭╮┈◢▇◣┈╭╮┃┈┃\n" 
        "╰┳╯┃╰━━┳┳┳╯┃╰┳╯\n" 
        "┈┃┈╰━━━┫┃┣━╯┈┃┈\n" 
        "┈┃┈┈┈┈┈╰━╯┈┈┈┃┈\n")
    
    
@register(outgoing=True, pattern='^.penis(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit( "MAU LIAT PENIS GA???")
    sleep(1)
    await zz.edit("NIHHHH DIAA")
    sleep(1)  
    await zz.edit("░░░░█─────────────█──▀──\n"
                  "░░░░▓█───────▄▄▀▀█──────\n"
                  "░░░░▒░█────▄█▒░░▄░█─────\n"
                  "░░░░░░░▀▄─▄▀▒▀▀▀▄▄▀──SIJONI─\n"
                  "░░░░░░░░░█▒░░░░▄▀────PANJANG\n"
                  "▒▒▒░░░░▄▀▒░░░░▄▀───DAN─\n"
                  "▓▓▓▓▒░█▒░░░░░█▄───PEMBERANI─\n"
                  "█████▀▒░░░░░█░▀▄───CROTT──\n"
                  "█████▒▒░░░▒█░░░▀▄─AHHH──\n"
                  "███▓▓▒▒▒▀▀▀█▄░░░░█──────\n"
                  "▓██▓▒▒▒▒▒▒▒▒▒█░░░░█─────\n"
                  "▓▓█▓▒▒▒▒▒▒▓▒▒█░░░░░█────\n"
                  "░▒▒▀▀▄▄▄▄█▄▄▀░░░░░░░█─\n")
    
    
@register(outgoing=True, pattern='^.ahhh(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit( "ahhh")
    await zz.edit("ahhh ahhh")
    await zz.edit("ahhh ahhh ahhh")
    await zz.edit("🥵")
    sleep(1)
    await zz.edit("⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⡠⠢⠏⣉⣉⠣⢦⡀⠄⠄⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣐⢪⠅⣱⣟⢛⢧⠄⣷⠄⠄⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⠄⠠⣬⣀⣢⣕⡽⢯⣩⣳⣷⠧⡆⠄⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⠄⢠⡭⡾⣆⢿⡙⢟⢻⣿⡿⡹⣶⠅⠄⠄⠄ \n"
                  "⠄⠄⠄⠄⠄⠄⠄⣔⠄⡗⢫⠘⠷⠾⠿⠟⠙⣡⢢⢖⠄⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⠄⢫⠺⠁⡹⢸⣿⣿⣿⡟⠲⣦⣌⢄⡇⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⢀⡈⢛⠨⠥⡄⣿⣿⣿⣧⢯⡻⡇⠨⣁⠄⠄\n"
                  "⠄⠄⠄⠄⠄⢠⡤⢠⣶⣿⣿⣿⣿⣿⣿⣿⣷⢗⠵⡐⡣⡄⠄\n"
                  "⠄⠄⠄⠄⠄⠸⢡⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣷⡄⢶⡇⡇⠄\n"
                  "⠄⠄⠄⠄⠄⣠⣿⣿⣿⣿⣿⠟⢸⣿⣿⣿⡟⡻⣿⠘⠧⡇⠄\n"
                  "⠄⠄⠄⠄⠄⢳⣿⣿⣿⡿⣫⣾⣜⢿⣿⣿⣷⣶⡿⢀⠗⡇⠄\n"
                  "⠄⠄⠄⠄⠄⣦⡝⣭⣵⣾⣿⣿⣿⣦⣍⣛⣛⣫⠡⣼⢾⣿⠄\n"
                  "⠄⠄⠄⠄⢰⣿⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄⠨⣿⡟⠄\n"
                  "⠄⠄⠄⢀⣿⡿⣿⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢆⣶⣿⠇⠄\n"
                  "⠄⠄⠄⢸⣿⣷⠎⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⢯⣿⣷⣻⡆⠄\n"
                  "⠄⠄⢀⣿⣿⠏⢸⡟⢿⣿⣿⣸⣿⣿⣿⣿⢏⣾⣿⣿⣏⣷⠄\n"
                  "⠄⠄⣸⣿⠏⢀⣼⣿⣎⡻⢿⣿⣿⣿⠿⣣⣾⣿⣿⣿⣿⣽⠄\n"
                  "⠄⠄⣿⡿⣰⣿⣿⣿⣿⣿ AHHH ⣰⣿⣿⣿⣿⣿⣿⣿\n")


GAMBAR_DICK = """
⣠⡶⠚⠛⠲⢄⡀
⣼⠁ ⠀⠀⠀ ⠳⢤⣄
⢿⠀⢧⡀⠀⠀⠀⠀⠀⢈⡇
⠈⠳⣼⡙⠒⠶⠶⠖⠚⠉⠳⣄
⠀⠀⠈⣇⠀⠀⠀⠀⠀⠀⠀⠈⠳⣄
⠀⠀⠀⠘⣆ ⠀⠀⠀⠀ ⠀⠈⠓⢦⣀
⠀⠀⠀⠀⠈⢳⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠲⢤
⠀⠀⠀⠀⠀⠀⠙⢦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧
⠀⠀⠀⠀⠀⠀⠀⡴⠋⠓⠦⣤⡀⠀⠀⠀⠀⠀⠀⠀⠈⣇
⠀⠀⠀⠀⠀⠀⣸⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡄
⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇
⠀⠀⠀⠀⠀⠀⢹⡄⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃
⠀⠀⠀⠀⠀⠀⠀⠙⢦⣀⣳⡀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠏
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠛⢦⣀⣀⣀⣀⣠⡴⠚⠁⠉⠉⠉
"""


GAMBAR_OK = """
░▐▀▀▀▀▀▀▀▀▌▐▀▌▄▄▄▀▀▓▀
░▐▌▓▀▀▀▀▓▌▌▐▐▌▀▌▄▄▀░░
░▐▐▌▐▀▀▌▐▐▌▐▌▐▓▄▀░░░░
░▐▌▌▐▄▄▌▐▌▌▐▐▌▓▀▄░░░░
░▐▐▓▄▄▄▄▓▐▌▐▌▌▄▌▀▀▄░░
░▐▄▄▄▄▄▄▄▄▌▐▄▌▀▀▀▄▄▓▄
"""


GAMBAR_TENGKORAK = """
░░░░░░░░░░░░░▄▐░░░░
░░░░░░░▄▄▄░░▄██▄░░░
░░░░░░▐▀█▀▌░░░░▀█▄░
░░░░░░▐█▄█▌░░░░░░▀█▄
░░░░░░░▀▄▀░░░▄▄▄▄▄▀▀
░░░░░▄▄▄██▀▀▀▀░░░░░
░░░░█▀▄▄▄█░▀▀░░░░░░
░░░░▌░▄▄▄▐▌▀▀▀░░░░░
░▄░▐░░░▄▄░█░▀▀░░░░░
░▀█▌░░░▄░▀█▀░▀░░░░░
░░░░░░░░▄▄▐▌▄▄░░░░░
░░░░░░░░▀███▀█▄░░░░
░░░░░░░▐▌▀▄▀▄▀▐░░░░
░░░░░░░▐▀░░░░░░▐▌░░
░░░░░░░█░░░░░░░░█░░
░░░░░░▐▌░░░░░░░░░█░
"""


@register(outgoing=True, pattern=r"^\.(?:penis2|dick)\s?(.)?")
async def emoji_penis(e):
    emoji = e.pattern_match.group(1)
    kontl = GAMBAR_DICK
    if emoji:
        kontl = kontl.replace('😂', emoji)
    await e.edit(kontl)


@register(outgoing=True, pattern=r"^\.oke$")
async def emoji_oke(e):
    emoji = e.pattern_match.group(1)
    oke = GAMBAR_OK
    if emoji:
        oke = oke.replace('😂', emoji)
    await e.edit(oke)


@register(outgoing=True, pattern=r"^\.tengkorak$")
async def emoji_tengkorak(e):
    emoji = e.pattern_match.group(1)
    tengkorak = GAMBAR_TENGKORAK
    if emoji:
        tengkorak = tengkorak.replace('😂', emoji)
    await e.edit(tengkorak)


@register(outgoing=True, pattern='^.punten(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`\n┻┳|―-∩`"
                     "`\n┳┻|     ヽ`"
                     "`\n┻┳|    ● |`"
                     "`\n┳┻|▼) _ノ`"
                     "`\n┻┳|￣  )`"
                     "`\n┳ﾐ(￣ ／`"
                     "`\n┻┳T￣|`"
                     "\n**Punten**")

# Create by myself @localheart


@register(outgoing=True, pattern='^.pantau(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`\n┻┳|―-∩`"
                     "`\n┳┻|     ヽ`"
                     "`\n┻┳|    ● |`"
                     "`\n┳┻|▼) _ノ`"
                     "`\n┻┳|￣  )`"
                     "`\n┳ﾐ(￣ ／`"
                     "`\n┻┳T￣|`"
                     "\n**Masih Ku Pantau**")

# Create by myself @localheart

@register(outgoing=True, pattern='^.ngintip(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`\n┻┳|―-∩`"
                     "`\n┳┻|     ヽ`"
                     "`\n┻┳|    ● |`"
                     "`\n┳┻|▼) _ノ`"
                     "`\n┻┳|￣  )`"
                     "`\n┳ﾐ(￣ ／`"
                     "`\n┻┳T￣|`"
                     "\n**Mau ngintip ada apa ya**")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.ngumpet(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`\n┻┳|―-∩`"
                     "`\n┳┻|     ヽ`"
                     "`\n┻┳|    ● |`"
                     "`\n┳┻|▼) _ノ`"
                     "`\n┻┳|￣  )`"
                     "`\n┳ﾐ(￣ ／`"
                     "`\n┻┳T￣|`"
                     "\n**Ketahuan engga yaa ngumpet disini**")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.idiot(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("\n╭╮╱╱╭╮"
                     "\n┃╰╮╭╯┃"
                     "\n╰╮╰╯╭┻━┳╮╭╮"
                     "\n╱╰╮╭┫╭╮┃┃┃┃"
                     "\n╱╱┃┃┃╰╯┃╰╯┃"
                     "\n╱╱╰╯╰━━┻━━╯"
                     "\nㅤㅤㅤ"
                     "\n╭━━━╮"
                     "\n┃╭━╮┃"
                     "\n┃┃╱┃┣━┳━━╮"
                     "\n┃╰━╯┃╭┫┃━┫"
                     "\n┃╭━╮┃┃┃┃━┫"
                     "\n╰╯╱╰┻╯╰━━╯"
                     "\nㅤㅤㅤ"
                     "\n╭━━━╮╱╭╮╱╱╱╭╮"
                     "\n┃╭━━╯╱┃┃╱╱╭╯╰╮"
                     "\n┃╰━━┳━╯┣┳━┻╮╭╯"
                     "\n┃╭━━┫╭╮┣┫╭╮┃┃"
                     "\n┃╰━━┫╰╯┃┃╰╯┃╰╮"
                     "\n╰━━━┻━━┻┻━━┻━╯"
                     "\nㅤㅤㅤ"
                     "\n╭━╮╱╭╮"
                     "\n┃┃╰╮┃┃"
                     "\n┃╭╮╰╯┣━━╮"
                     "\n┃┃╰╮┃┃╭╮┃"
                     "\n┃┃╱┃┃┃╰╯┃"
                     "\n╰╯╱╰━┻━━╯"
                     "\nㅤㅤㅤ"
                     "\n╭━━━╮╱╱╱╱╱╭╮╱╭╮"
                     "\n╰╮╭╮┃╱╱╱╱╱┃┃╭╯╰╮"
                     "\n╱┃┃┃┣━━┳╮╭┫╰┻╮╭╯"
                     "\n╱┃┃┃┃╭╮┃┃┃┃╭╮┃┃"
                     "\n╭╯╰╯┃╰╯┃╰╯┃╰╯┃╰╮"
                     "\n╰━━━┻━━┻━━┻━━┻━╯")


@register(outgoing=True, pattern=r"^\.bau$")
async def gey(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("`\n┈┈┈╭━━━━━╮┈┈┈┈┈\n┈┈┈┃┊┊┊┊┊┃┈┈┈┈┈`"
                     "`\n┈┈┈┃┊┊╭━╮┻╮┈┈┈┈\n┈┈┈╱╲┊┃▋┃▋┃┈┈┈┈\n┈┈╭┻┊┊╰━┻━╮┈┈┈┈`"
                     "`\n┈┈╰┳┊╭━━━┳╯┈┈┈┈\n┈┈┈┃┊┃╰━━┫┈Lu Bau Hehe`"
                     "\n┈┈┈┈┈┈┏━┓┈┈┈┈┈┈")


@register(outgoing=True, pattern=r"^\.gay$")
async def gey(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("`\n┈┈┈╭━━━━━╮┈┈┈┈┈\n┈┈┈┃┊┊┊┊┊┃┈┈┈┈┈`"
                     "`\n┈┈┈┃┊┊╭━╮┻╮┈┈┈┈\n┈┈┈╱╲┊┃▋┃▋┃┈┈┈┈\n┈┈╭┻┊┊╰━┻━╮┈┈┈┈`"
                     "`\n┈┈╰┳┊╭━━━┳╯┈┈┈┈\n┈┈┈┃┊┃╰━━┫┈ANDA GAY`"
                     "\n┈┈┈┈┈┈┏━┓┈┈┈┈┈┈")

@register(outgoing=True, pattern=r"^\.manis$")
async def gey(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("`\n┈┈┈╭━━━━━╮┈┈┈┈┈\n┈┈┈┃┊┊┊┊┊┃┈┈┈┈┈`"
                     "`\n┈┈┈┃┊┊╭━╮┻╮┈┈┈┈\n┈┈┈╱╲┊┃▋┃▋┃┈┈┈┈\n┈┈╭┻┊┊╰━┻━╮┈┈┈┈`"
                     "`\n┈┈╰┳┊╭━━━┳╯┈┈┈┈\n┈┈┈┃┊┃╰━━┫┈Kamu Manis`"
                     "\n┈┈┈┈┈┈┏━┓┈┈┈┈┈┈")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern=r"^\.bot$")
async def bot(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("` \n   ╲╲╭━━━━╮ \n╭╮┃▆┈┈▆┃╭╮ \n┃╰┫▽▽▽┣╯┃ \n╰━┫△△△┣━╯`"
                     "`\n╲╲┃┈┈┈┈┃  \n╲╲┃┈┏┓┈┃ `")


@register(outgoing=True, pattern=r"^\.hey$")
async def hey(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("\n┈┈┈╱▔▔▔▔╲┈╭━━━━━\n┈┈▕▂▂▂▂▂▂▏┃HEY!┊😀`"
                     "`\n┈┈▕▔▇▔▔┳▔▏╰┳╮HEY!┊\n┈┈▕╭━╰╯━╮▏━╯╰━━━\n╱▔▔▏▅▅▅▅▕▔▔╲┈┈┈┈`"
                     "`\n▏┈┈╲▂▂▂▂╱┈┈┈▏┈┈┈`")


@register(outgoing=True, pattern=r"^\.hallo$")
async def hallo(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("`\n┈╭╮╭╮\n┈┃┃┃┃\n╭┻┗┻┗╮`"
                     "`\n┃┈▋┈▋┃\n┃┈╭▋━╮━╮\n┃┈┈╭╰╯╰╯╮`"
                     "`\n┫┈┈  Hallo\n┃┈╰╰━━━━╯`"
                     "`\n┗━━┻━┛`")


@register(outgoing=True, pattern=r"^\.fail$")
async def fail(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("`\n▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄ `"
                     "`\n████▌▄▌▄▐▐▌█████ `"
                     "`\n████▌▄▌▄▐▐▌▀████ `"
                     "`\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ `")


@register(outgoing=True, pattern=r"^\.lol$")
async def lol(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("`\n╱┏┓╱╱╱╭━━━╮┏┓╱╱╱╱ `"
                     "`\n╱┃┃╱╱╱┃╭━╮┃┃┃╱╱╱╱ `"
                     "`\n╱┃┗━━┓┃╰━╯┃┃┗━━┓╱ `"
                     "`\n╱┗━━━┛╰━━━╯┗━━━┛╱ `")


@register(outgoing=True, pattern=r"^\.rock$")
async def lol(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("`\n┈╭╮┈┈┈┈┈┈┈┈┈┈┈┈ `"
                     "`\n┈┃┃┈╭╮┈┏╮╭╮╭╮┃╭ `"
                     "`\n┈┃┃┈┃┃┈┣┫┃┃┃┈┣┫ `"
                     "`\n┈┃┣┳┫┃┈┃╰╰╯╰╯┃╰ `"
                     "`\n╭┻┻┻┫┃┈┈╭╮┃┃━┳━ `"
                     "`\n┃╱╭━╯┃┈┈┃┃┃┃┈┃┈ `"
                     "`\n╰╮╱╱╱┃┈┈╰╯╰╯┈┃┈ `")


@register(outgoing=True, pattern=r"^\.lool$")
async def lool(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("`\n╭╭━━━╮╮┈┈┈┈┈┈┈┈┈┈\n┈┃╭━━╯┈┈┈┈▕╲▂▂╱▏┈\n┈┃┃╱▔▔▔▔▔▔▔▏╱▋▋╮┈`"
                     "`\n┈┃╰▏┃╱╭╮┃╱╱▏╱╱▆┃┈\n┈╰━▏┗━╰╯┗━╱╱╱╰┻┫┈\n┈┈┈▏┏┳━━━━▏┏┳━━╯┈`"
                     "`\n┈┈┈▏┃┃┈┈┈┈▏┃┃┈┈┈┈ `")


@register(outgoing=True, pattern=r"^\.rawr$")
async def rawr(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit("`\n█████████`"
                     "`\n█▄█████▄█`"
                     "`\n█▼▼▼▼▼`"
                     "`\n█       Buat Kamu nih Rawr`"
                     "`\n█▲▲▲▲▲`"
                     "`\n█████████`"
                     "`\n ██   ██`")


@register(outgoing=True, pattern=r"^\.sayhi$")
async def sayhi(e):
    await e.edit(
        "\n✨✨✨✨✨✨✨✨✨✨✨✨"
        "\n✨❤️❤️✨✨❤️❤️✨✨❤️❤️✨"
        "\n✨❤️❤️✨✨❤️❤️✨✨❤️❤️✨"
        "\n✨❤️❤️✨✨❤️❤️✨✨❤️❤️✨"
        "\n✨❤️❤️❤️❤️❤️❤️✨✨❤️❤️✨"
        "\n✨❤️❤️❤️❤️❤️❤️✨✨❤️❤️✨"
        "\n✨❤️❤️✨✨❤️❤️✨✨❤️❤️✨"
        "\n✨❤️❤️✨✨❤️❤️✨✨❤️❤️✨"
        "\n✨❤️❤️✨✨❤️❤️✨✨❤️❤️✨"
        "\n✨✨✨✨✨✨✨✨✨✨✨✨")


@register(outgoing=True, pattern='^.helikopter(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("▬▬▬.◙.▬▬▬ \n"
                     "═▂▄▄▓▄▄▂ \n"
                     "◢◤ █▀▀████▄▄▄▄◢◤ \n"
                     "█▄ █ █▄ ███▀▀▀▀▀▀▀╬ \n"
                     "◥█████◤ \n"
                     "══╩══╩══ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ Hallo Semuanya,AKU DATANG :) \n"
                     "╬═╬☻/ \n"
                     "╬═╬/▌ \n"
                     "╬═╬/ \\ \n")

@register(outgoing=True, pattern='^.helikopter2(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("▬▬▬.◙.▬▬▬ \n"
                     "═▂▄▄▓▄▄▂ \n"
                     "◢◤ █▀▀████▄▄▄▄◢◤ \n"
                     "█▄ █ █▄ ███▀▀▀▀▀▀▀╬ \n"
                     "◥█████◤ \n"
                     "══╩══╩══ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ DADAH Semuanya,AKU PULANG dulu :v \n"
                     "╬═╬☻/ \n"
                     "╬═╬/▌ \n"
                     "╬═╬/ \\ \n")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.helikopter3(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("▬▬▬.◙.▬▬▬ \n"
                     "═▂▄▄▓▄▄▂ \n"
                     "◢◤ █▀▀████▄▄▄▄◢◤ \n"
                     "█▄ █ █▄ ███▀▀▀▀▀▀▀╬ \n"
                     "◥█████◤ \n"
                     "══╩══╩══ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ \n"
                     "╬═╬ Woyyy.. sini Mau ikut naik ga? \n"
                     "╬═╬☻/ \n"
                     "╬═╬/▌ \n"
                     "╬═╬/ \\ \n")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.bundir(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`Dadah Semuanya...`          \n　　　　　|"
                     "\n　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　／￣￣＼| \n"
                     "＜ ´･ 　　 |＼ \n"
                     "　|　３　 | 丶＼ \n"
                     "＜ 、･　　|　　＼ \n"
                     "　＼＿＿／∪ _ ∪) \n"
                     "　　　　　 Ｕ Ｕ\n")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.bundir3(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`Bundir aja... Gaada yang sayang juga`          \n　　　　　|"
                     "\n　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　／￣￣＼| \n"
                     "＜ ´･ 　　 |＼ \n"
                     "　|　３　 | 丶＼ \n"
                     "＜ 、･　　|　　＼ \n"
                     "　＼＿＿／∪ _ ∪) \n"
                     "　　　　　 Ｕ Ｕ\n")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.bundir2(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`Dah lah... Mati aja`          \n　　　　　|"
                     "\n　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　　　　　| \n"
                     "　／￣￣＼| \n"
                     "＜ ´･ 　　 |＼ \n"
                     "　|　３　 | 丶＼ \n"
                     "＜ 、･　　|　　＼ \n"
                     "　＼＿＿／∪ _ ∪) \n"
                     "　　　　　 Ｕ Ｕ\n")

@register(outgoing=True, pattern='^.ular(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("░░░░▓\n"
                     "░░░▓▓\n"
                     "░░█▓▓█\n"
                     "░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░░░██▓▓██\n"
                     "░░░░██▓▓██\n"
                     "░░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░██▓▓██\n"
                     "░░░██▓▓███\n"
                     "░░░░██▓▓████\n"
                     "░░░░░██▓▓█████\n"
                     "░░░░░░██▓▓██████\n"
                     "░░░░░░███▓▓███████\n"
                     "░░░░░████▓▓████████\n"
                     "░░░░█████▓▓█████████\n"
                     "░░░█████░░░█████●███\n"
                     "░░████░░░░░░░███████\n"
                     "░░███░░░░░░░░░██████\n"
                     "░░██░░░░░░░░░░░████\n"
                     "░░░░░░░░░░░░░░░░███\n"
                     "░░░░░░░░░░░░░░░░░░░\n")

@register(outgoing=True, pattern='^.ular2(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(    
        "▃▅▆██████▆▅▃\n"
        "█▒⚫▒🔰▒⚫▒█\n"
        "█▒▒▒▒➖▒▒▒▒█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣◢ ░▒▓█ \n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣◢ ░▒▓█ \n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n"
        "█▓▒░ ◣​◢ ░▒▓█\n")

# Created by @greyyvbss

@register(outgoing=True, pattern='^.sip(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("‡‡‡‡‡‡‡‡‡‡‡‡▄▄▄▄\n"
                     "‡‡‡‡‡‡‡‡‡‡‡█‡‡‡‡█\n"
                     "‡‡‡‡‡‡‡‡‡‡‡█‡‡‡‡█\n"
                     "‡‡‡‡‡‡‡‡‡‡█‡‡‡‡‡█\n"
                     "‡‡‡‡‡‡‡‡‡█‡‡‡‡‡‡█\n"
                     "██████▄▄█‡‡‡‡‡‡████████▄\n"
                     "▓▓▓▓▓▓█‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡█\n"
                     "▓▓▓▓▓▓█‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡█\n"
                     "▓▓▓▓▓▓█‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡█\n"
                     "▓▓▓▓▓▓█‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡█\n"
                     "▓▓▓▓▓▓█‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡█\n"
                     "▓▓▓▓▓▓█████‡‡‡‡‡‡‡‡‡‡‡‡██\n"
                     "█████‡‡‡‡‡‡‡██████████\n")


@register(outgoing=True, pattern='^.tank(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("█۞███████]▄▄▄▄▄▄▄▄▄▄▃ \n"
                     "▂▄▅█████████▅▄▃▂…\n"
                     "[███████████████████]\n"
                     "◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤\n")


@register(outgoing=True, pattern='^.babi(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("┈┈┏━╮╭━┓┈╭━━━━╮\n"
                     "┈┈┃┏┗┛┓┃╭┫Ngok ┃\n"
                     "┈┈╰┓▋▋┏╯╯╰━━━━╯\n"
                     "┈╭━┻╮╲┗━━━━╮╭╮┈\n"
                     "┈┃▎▎┃╲╲╲╲╲╲┣━╯┈\n"
                     "┈╰━┳┻▅╯╲╲╲╲┃┈┈┈\n"
                     "┈┈┈╰━┳┓┏┳┓┏╯┈┈┈\n"
                     "┈┈┈┈┈┗┻┛┗┻┛┈┈┈┈\n")


@register(outgoing=True, pattern='^.anjing(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("╥━━━━━━━━╭━━╮━━┳\n"
                     "╢╭╮╭━━━━━┫┃▋▋━▅┣\n"
                     "╢┃╰┫┈┈┈┈┈┃┃┈┈╰┫┣\n"
                     "╢╰━┫┈┈┈┈┈╰╯╰┳━╯┣\n"
                     "╢┊┊┃┏┳┳━━┓┏┳┫┊┊┣\n"
                     "╨━━┗┛┗┛━━┗┛┗┛━━┻\n")

@register(outgoing=True, pattern='^.musang(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        " ╱▏┈┈┈┈┈┈▕╲▕╲┈┈┈\n"
        "▏▏┈┈┈┈┈┈▕▏▔▔╲┈┈\n"
        "▏╲┈┈┈┈┈┈╱┈▔┈▔╲┈\n"
        "╲▏▔▔▔▔▔▔╯╯╰┳━━▀\n"
        "┈▏╯╯╯╯╯╯╯╯╱┃┈┈┈\n"
        "┈┃┏┳┳━━━┫┣┳┃┈┈┈\n"
        "┈┃┃┃┃┈┈┈┃┃┃┃┈┈┈\n"
        "┈┗┛┗┛┈┈┈┗┛┗┛┈┈┈")

# Created by @greyyvbss

@register(outgoing=True, pattern='^.gajah(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "┈┈┈┈╱▔▔▔▔▔╲┈╱▔╲\n"
        "┈┈┈┈▏┈┈▏╭╮▕┈▏╳▕\n"
        "┈┈┈┈▏┈┈▏┈┈▕┈╲▂╱\n"
        "┈╱▔▔╲▂╱╲▂▂┈╲▂▏▏\n"
        "╭▏┈┈┈┈┈┈┈▏╲▂▂╱┈\n"
        "┃▏┈┈┈┈▏┈┈▏┈┈┈┈┈\n"
        "╯▏┈╲╱▔╲▅▅▏┈┈┈┈\n"
        "┈╲▅▅▏▕▔▔▔▔▏┈┈┈┈")

# Created by @greyyvbss

@register(outgoing=True, pattern='^.spongebob(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "┈┈╱▔▔▔▔▔▔▔▔▔▔▔▏\n"
        "┈╱╭▏╮╭┻┻╮╭┻┻╮╭▏ \n"
        "▕╮╰▏╯┃╭╮┃┃╭╮┃╰▏ \n"
        "▕╯┈▏┈┗┻┻┛┗┻┻┻╮▏ \n"
        "▕╭╮▏╮┈┈┈┈┏━━━╯▏\n"
        "▕╰╯▏╯╰┳┳┳┳┳┳╯╭▏ \n"
        "▕┈╭▏╭╮┃┗┛┗┛┃┈╰▏ \n"
        "▕┈╰▏╰╯╰━━━━╯┈┈▏ν2.ο\n"
        "           **BOBBB**      ")

# Created by @greyyvbss
# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.spongebob2(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "┈┈╱▔▔▔▔▔▔▔▔▔▔▔▏\n"
        "┈╱╭▏╮╭┻┻╮╭┻┻╮╭▏ \n"
        "▕╮╰▏╯┃╭╮┃┃╭╮┃╰▏ \n"
        "▕╯┈▏┈┗┻┻┛┗┻┻┻╮▏ \n"
        "▕╭╮▏╮┈┈┈┈┏━━━╯▏\n"
        "▕╰╯▏╯╰┳┳┳┳┳┳╯╭▏ \n"
        "▕┈╭▏╭╮┃┗┛┗┛┃┈╰▏ \n"
        "▕┈╰▏╰╯╰━━━━╯┈┈▏ν2.ο\n"
        "           **Yuk ke ladang ubur ubur**")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.spongebob3(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "┈┈╱▔▔▔▔▔▔▔▔▔▔▔▏\n"
        "┈╱╭▏╮╭┻┻╮╭┻┻╮╭▏ \n"
        "▕╮╰▏╯┃╭╮┃┃╭╮┃╰▏ \n"
        "▕╯┈▏┈┗┻┻┛┗┻┻┻╮▏ \n"
        "▕╭╮▏╮┈┈┈┈┏━━━╯▏\n"
        "▕╰╯▏╯╰┳┳┳┳┳┳╯╭▏ \n"
        "▕┈╭▏╭╮┃┗┛┗┛┃┈╰▏ \n"
        "▕┈╰▏╰╯╰━━━━╯┈┈▏ν2.ο\n"
        "           **Main bareng Patrick yuk**")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.spongebob4(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "┈┈╱▔▔▔▔▔▔▔▔▔▔▔▏\n"
        "┈╱╭▏╮╭┻┻╮╭┻┻╮╭▏ \n"
        "▕╮╰▏╯┃╭╮┃┃╭╮┃╰▏ \n"
        "▕╯┈▏┈┗┻┻┛┗┻┻┻╮▏ \n"
        "▕╭╮▏╮┈┈┈┈┏━━━╯▏\n"
        "▕╰╯▏╯╰┳┳┳┳┳┳╯╭▏ \n"
        "▕┈╭▏╭╮┃┗┛┗┛┃┈╰▏ \n"
        "▕┈╰▏╰╯╰━━━━╯┈┈▏ν2.ο\n"
        "           **Yuk Pergi ke Krusty Krab**")

# Modifikasi edit by @punya_alby

@register(outgoing=True, pattern='^.lonte(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(
        "´´´´´████████´´\n"
        "´´`´███▒▒▒▒███´´´´´\n"
        "´´´███▒●▒▒●▒██´´´\n"
        "´´´███▒▒👄▒▒██´´\n"
        "´´██████▒▒███´´´´´\n"
        "´██████▒▒▒▒███´´\n"
        "██████▒▒▒▒▒▒███´´´´\n"
        "´´▓▓▓▓▓▓▓▓▓▓▓▓▓▒´´\n"
        "´´▒▒▒▒▓▓▓▓▓▓▓▓▓▒´´´´´\n"
        "´.▒▒▒´´▓▓▓▓▓▓▓▓▒´´´´´\n"
        "´.▒▒´´´´▓▓▓▓▓▓▓▒\n"
        "..▒▒.´´´´▓▓▓▓▓▓▓▒\n"
        "´▒▒▒▒▒▒▒▒▒▒▒▒\n"
        "´´´´´´´´´███████´´´´\n"
        "´´´´´´´´████████´´´´´´\n"
        "´´´´´´´█████████´´´´´\n"
        "´´´´´´██████████´´´\n"
        "´´´´´´██████████´´\n"
        "´´´´´´´█████████´\n"
        "´´´´´´´█████████´\n"
        "´´´´´´´´████████´´´\n"
        "         ▒▒▒▒▒\n"
        "         ▒▒▒▒\n"
        "         ▒▒▒▒\n"
        "        ▒▒ ▒▒\n"
        "       ▒▒  ▒▒\n"
        "      ▒▒   ▒▒\n"
        "    _▒▒    ▒▒\n"
        "    ▒▒     ▒▒\n"
        "    ▒▒     ▒▒\n"
        "  ███     ███\n"    
        " ███      ███\n"
        "█ ████    █ ███\n")

# Created by @greyyvbss

@register(outgoing=True, pattern='^.loveyou(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(    
        "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️\n"
        "❤️╔╦╦╦╦╦╦╦╦╦╦╦╦╗❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬██████╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬██╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬██╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬██╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬██╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬██████╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬████╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬██╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬██╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬██╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬██╬╬█╬╬╬╣❤️\n"
        "❤️╠╬╬╬██████╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬████╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬█╬╬╬╬█╬╬╬╣❤️\n"
        "❤️╠╬╬██╬╬╬╬██╬╬╣❤️\n"
        "❤️╠╬╬██╬╬╬╬██╬╬╣❤️\n"
        "❤️╠╬╬╬█╬╬╬╬█╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬████╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬███╬╬╬╬███╬╣❤️\n"
        "❤️╠╬╬██╬╬╬╬██╬╬╣❤️\n"
        "❤️╠╬╬╬█╬╬╬╬█╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬█╬╬█╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬██╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬████████╬╬╣❤️\n"
        "❤️╠╬╬╬██╬╬╬╬█╬╬╣❤️\n"
        "❤️╠╬╬╬██╬█╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬█████╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬██╬█╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬██╬╬╬╬█╬╬╣❤️\n"
        "❤️╠╬╬████████╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╠█╬╬█╬╬█╬╬█╬█╣❤️\n"
        "❤️╠█╬╬█╬█╬█╬█╬█╣❤️\n"
        "❤️╠████╬█╬█╬█╬█╣❤️\n"
        "❤️╠╬╬╬█╬█╬█╬█╬█╣❤️\n"
        "❤️╠█╬╬█╬█╬█╬█╬█╣❤️\n"
        "❤️╠████╬╬█╬╬███╣❤️\n"
        "❤️╠╬╬╬╬╬╬╬╬╬╬╬╬╣❤️\n"
        "❤️╚╩╩╩╩╩╩╩╩╩╩╩╩╝❤️\n"
        "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️\n")    

# Created by @greyyvbss
